Revit 2024 API
PDFExportQualityType Enumeration
 An enumerated type listing the options for PDF export quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum PDFExportQualityType
Visual Basic
Public Enumeration PDFExportQualityType
Visual C++
public enum class PDFExportQualityType
Members
Member name | Description
DPI72
DPI144
DPI300
DPI600
DPI1200
DPI2400
DPI3600
DPI4000
See Also
Autodesk.Revit.DB Namespace